In [2]:
list=[]
n=input("Enter the number of data")
for i in range(int(n)):
    d={}
    d["Name"]=input("Enter your Name:")
    d["Mark1"]=int(input("Enter marks1:"))
    d["Mark2"]=int(input("Enter mark2:"))
    list.append(d)
    print(list)

Enter the number of data3
Enter your Name:Nikunj
Enter marks1:50
Enter mark2:60
[{'Name': 'Nikunj', 'Mark1': 50, 'Mark2': 60}]
Enter your Name:Jigar
Enter marks1:60
Enter mark2:80
[{'Name': 'Nikunj', 'Mark1': 50, 'Mark2': 60}, {'Name': 'Jigar', 'Mark1': 60, 'Mark2': 80}]
Enter your Name:Raj
Enter marks1:80
Enter mark2:90
[{'Name': 'Nikunj', 'Mark1': 50, 'Mark2': 60}, {'Name': 'Jigar', 'Mark1': 60, 'Mark2': 80}, {'Name': 'Raj', 'Mark1': 80, 'Mark2': 90}]

In [4]:
import pandas as pd

In [6]:
#conver list into series
a1=pd.Series(data=list)
a1

0    {'Name': 'Nikunj', 'Mark1': 50, 'Mark2': 60}
1     {'Name': 'Jigar', 'Mark1': 60, 'Mark2': 80}
2       {'Name': 'Raj', 'Mark1': 80, 'Mark2': 90}
dtype: object

In [7]:
marks=[45,67,89,90]
a2=pd.Series(data=marks)
a2

0    45
1    67
2    89
3    90
dtype: int64

In [8]:
type(a2)

pandas.core.series.Series

In [9]:
Names=['Nikunj','Raj','Roshan',"Ajay"]
a3=pd.Series(data=Names)
a3

0    Nikunj
1       Raj
2    Roshan
3      Ajay
dtype: object

In [10]:
type(a3)

pandas.core.series.Series

In [12]:
Student={"name":Names,"Mark":marks}
Student

{'name': ['Nikunj', 'Raj', 'Roshan', 'Ajay'], 'Mark': [45, 67, 89, 90]}

In [13]:
type(Student)

dict

In [14]:
#Dataframe
a4=pd.DataFrame(data=Student,index=['A','B','C','D'])
a4

     name  Mark
A  Nikunj    45
B     Raj    67
C  Roshan    89
D    Ajay    90

In [15]:
#Dataframe size
a4.shape

(4, 2)

In [16]:
a4.info

<bound method DataFrame.info of      name  Mark
A  Nikunj    45
B     Raj    67
C  Roshan    89
D    Ajay    90>

In [17]:
a4.describe

<bound method NDFrame.describe of      name  Mark
A  Nikunj    45
B     Raj    67
C  Roshan    89
D    Ajay    90>

In [18]:
#top 5 record for multiple data
a4.head()

     name  Mark
A  Nikunj    45
B     Raj    67
C  Roshan    89
D    Ajay    90

In [19]:
a4.head(2)

     name  Mark
A  Nikunj    45
B     Raj    67

In [20]:

#last 5 records to shown
a4.tail()

     name  Mark
A  Nikunj    45
B     Raj    67
C  Roshan    89
D    Ajay    90

In [21]:
a4.tail(2)

     name  Mark
C  Roshan    89
D    Ajay    90

In [23]:
a5=pd.read_csv('Student.csv')
a5

       Name  Age  Mark
0     Jigar   22    70
1   Dhrumit   21    80
2      Raju   20    70
3     Karan   25    55
4     Rahul   23    63
5      Aman   24    29
6     Jugnu   19    54
7      Asad   22    80
8     Faltu   23    57
9     Sneha   21    29
10   Saloni   20    65
11  Maitrii   25    49
12  Darshan   24    52
13   Roshan   26    99
14     Vraj   20    97
15   Reenal   23    90
16      Jay   18    88
17   Manali   26    56
18    Hiral   23    15

In [24]:
type(a5)

pandas.core.frame.DataFrame

In [30]:
#string index a5.iloc[row_index,column_index]
print(a5.iloc[2,1])

20

In [31]:
#find columns:kist of columns
a5.columns

Index(['Name', 'Age', 'Mark'], dtype='object')

In [34]:
a5['Name']

0       Jigar
1     Dhrumit
2        Raju
3       Karan
4       Rahul
5        Aman
6       Jugnu
7        Asad
8       Faltu
9       Sneha
10     Saloni
11    Maitrii
12    Darshan
13     Roshan
14       Vraj
15     Reenal
16        Jay
17     Manali
18      Hiral
Name: Name, dtype: object

In [35]:
#top 5 records
a5.head()

      Name  Age  Mark
0    Jigar   22    70
1  Dhrumit   21    80
2     Raju   20    70
3    Karan   25    55
4    Rahul   23    63

In [36]:
a5.shape

(19, 3)

In [37]:
a5.describe

<bound method NDFrame.describe of        Name  Age  Mark
0     Jigar   22    70
1   Dhrumit   21    80
2      Raju   20    70
3     Karan   25    55
4     Rahul   23    63
5      Aman   24    29
6     Jugnu   19    54
7      Asad   22    80
8     Faltu   23    57
9     Sneha   21    29
10   Saloni   20    65
11  Maitrii   25    49
12  Darshan   24    52
13   Roshan   26    99
14     Vraj   20    97
15   Reenal   23    90
16      Jay   18    88
17   Manali   26    56
18    Hiral   23    15>

In [39]:
a5.info

<bound method DataFrame.info of        Name  Age  Mark
0     Jigar   22    70
1   Dhrumit   21    80
2      Raju   20    70
3     Karan   25    55
4     Rahul   23    63
5      Aman   24    29
6     Jugnu   19    54
7      Asad   22    80
8     Faltu   23    57
9     Sneha   21    29
10   Saloni   20    65
11  Maitrii   25    49
12  Darshan   24    52
13   Roshan   26    99
14     Vraj   20    97
15   Reenal   23    90
16      Jay   18    88
17   Manali   26    56
18    Hiral   23    15>

In [41]:
#find multiple columns
a5[['Name','Age']]

       Name  Age
0     Jigar   22
1   Dhrumit   21
2      Raju   20
3     Karan   25
4     Rahul   23
5      Aman   24
6     Jugnu   19
7      Asad   22
8     Faltu   23
9     Sneha   21
10   Saloni   20
11  Maitrii   25
12  Darshan   24
13   Roshan   26
14     Vraj   20
15   Reenal   23
16      Jay   18
17   Manali   26
18    Hiral   23

In [48]:
#[first how many row uh want,how many column you want]
print(a5.iloc[10:,:2])

       Name  Age
10   Saloni   20
11  Maitrii   25
12  Darshan   24
13   Roshan   26
14     Vraj   20
15   Reenal   23
16      Jay   18
17   Manali   26
18    Hiral   23

In [43]:
print(a5.iloc[12:19])

       Name  Age  Mark
12  Darshan   24    52
13   Roshan   26    99
14     Vraj   20    97
15   Reenal   23    90
16      Jay   18    88
17   Manali   26    56
18    Hiral   23    15

In [46]:
a5.head(3)

      Name  Age  Mark
0    Jigar   22    70
1  Dhrumit   21    80
2     Raju   20    70

In [47]:
a5.tail(3)

      Name  Age  Mark
16     Jay   18    88
17  Manali   26    56
18   Hiral   23    15

In [49]:
#add new column
a5['mark2']=[34,56,66,59,41,25,78,52,19,76,48,38,98,78,99,85,78,75,49]
a5

       Name  Age  Mark  mark2
0     Jigar   22    70     34
1   Dhrumit   21    80     56
2      Raju   20    70     66
3     Karan   25    55     59
4     Rahul   23    63     41
5      Aman   24    29     25
6     Jugnu   19    54     78
7      Asad   22    80     52
8     Faltu   23    57     19
9     Sneha   21    29     76
10   Saloni   20    65     48
11  Maitrii   25    49     38
12  Darshan   24    52     98
13   Roshan   26    99     78
14     Vraj   20    97     99
15   Reenal   23    90     85
16      Jay   18    88     78
17   Manali   26    56     75
18    Hiral   23    15     49

In [50]:
#total of two column
a5['Total']=a5['Mark']+a5['mark2']

In [51]:
a5

       Name  Age  Mark  mark2  Total
0     Jigar   22    70     34    104
1   Dhrumit   21    80     56    136
2      Raju   20    70     66    136
3     Karan   25    55     59    114
4     Rahul   23    63     41    104
5      Aman   24    29     25     54
6     Jugnu   19    54     78    132
7      Asad   22    80     52    132
8     Faltu   23    57     19     76
9     Sneha   21    29     76    105
10   Saloni   20    65     48    113
11  Maitrii   25    49     38     87
12  Darshan   24    52     98    150
13   Roshan   26    99     78    177
14     Vraj   20    97     99    196
15   Reenal   23    90     85    175
16      Jay   18    88     78    166
17   Manali   26    56     75    131
18    Hiral   23    15     49     64

In [54]:
a5 = a5.rename(columns={'mark2': 'Mark2'})

a5

       Name  Age  Mark1  Mark2  Total
0     Jigar   22     70     34    104
1   Dhrumit   21     80     56    136
2      Raju   20     70     66    136
3     Karan   25     55     59    114
4     Rahul   23     63     41    104
5      Aman   24     29     25     54
6     Jugnu   19     54     78    132
7      Asad   22     80     52    132
8     Faltu   23     57     19     76
9     Sneha   21     29     76    105
10   Saloni   20     65     48    113
11  Maitrii   25     49     38     87
12  Darshan   24     52     98    150
13   Roshan   26     99     78    177
14     Vraj   20     97     99    196
15   Reenal   23     90     85    175
16      Jay   18     88     78    166
17   Manali   26     56     75    131
18    Hiral   23     15     49     64

In [ ]:
df = df.rename(columns={'old_name': 'new_name'})